Revit 2027 API
BuiltInFailures.RoofFailures.NoFlatCurtainRoofs Property
 A Sloped Glazing with no slope is not allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoFlatCurtainRoofs { get; }
Public Shared ReadOnly Property NoFlatCurtainRoofs As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoFlatCurtainRoofs {
	FailureDefinitionId^ get ();
}
static member NoFlatCurtainRoofs : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace